Инструкция:


**Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.**

<!-- Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → [] -->



Console.Write("Введите элементы массива через пробел:  "); 
 Запрос на ввод элементов массива через консоль
string input = Console.ReadLine() ?? "0"; 
 Считывание введенных пользователем значений и сохранение в строковую переменную

string[] inputArr = input.Split(" "); 
 Разделение строки на массив строк, используя пробел в качестве разделителя
string[] outputArr = new string[inputArr.Length ]; 
 Создание массива строк для хранения отфильтрованных значений 
int outputIndex = 0; 
 Индекс элемента отфильтрованного массива, куда будет добавляться следующий элемент
foreach (var item in inputArr) { 
       Перебор каждого элемента исходного массива
    if (item.Length <= 3) { 
       Проверка длины элемента
        outputArr[outputIndex++ ] = $"\"{item}\""; 
        Если длина меньше или равна 3 символам, добавление элемента в массив отфильтрованных значений и увеличение индекса на 1. Элемент должен быть в кавычках
    }
}

Array.Resize(ref outputArr, outputIndex); 
 Изменение размера массива отфильтрованных значений до реального размера

Console.WriteLine($"Результат: [{string.Join(", ", outputArr)}]"); 
 Вывод результата на консоль в квадратных скобках с разделением запятой